#### KeyBasedTreeEntryError Members

---

|  |
| --- |
| KeyBasedTreeEntryError Class   Methods   Properties   See Also |

The  KeyBasedTreeEntryError  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  KeyBasedTreeEntryError |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetEntry | Gets the entry for which an error occurred while building the KeyBasedTreeEntries object. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ErrorType | Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

KeyBasedTreeEntryError Class

Autodesk.Revit.DB Namespace